src/Reports/ОтчетПоПроизводственнымЗаданиямСводный/ОтчетПоПроизводственнымЗаданиямСводный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроизводственнымЗаданиямСводный</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МТК</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/СтендовыйПрогон/СтендовыйПрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтендовыйПрогон</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Прогон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПоступление</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПостановка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСнятие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыРемонта/СтатусыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРемонта</name>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Окончен</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектовка</name>
  </enumValues>
</mdclass:Enum>

src/Reports/ОтчетПоПроизводственнымЗаданиямСводный/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Макет = Отчеты.ОтчетПоПроизводственнымЗаданиямСводный.ПолучитьМакет("Макет"); 
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаСтенд = Макет.ПолучитьОбласть("Шапка|Стенд");
ОблШапкаРемонт = Макет.ПолучитьОбласть("Шапка|Ремонт");
	
ОблМТКОбщие = Макет.ПолучитьОбласть("МТК|Общие");	
ОблМТКРабочееМесто = Макет.ПолучитьОбласть("МТК|РабочееМесто");
ОблМТКСтенд = Макет.ПолучитьОбласть("МТК|Стенд");
ОблМТКРемонт = Макет.ПолучитьОбласть("МТК|Ремонт");

ОблПЗОбщие = Макет.ПолучитьОбласть("ПЗ|Общие");	
ОблПЗРабочееМесто = Макет.ПолучитьОбласть("ПЗ|РабочееМесто");
ОблПЗСтенд = Макет.ПолучитьОбласть("ПЗ|Стенд");
ОблПЗРемонт = Макет.ПолучитьОбласть("ПЗ|Ремонт");
	
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");	
ОблКонецРабочееМесто = Макет.ПолучитьОбласть("Конец|РабочееМесто");
ОблКонецСтенд = Макет.ПолучитьОбласть("Конец|Стенд");
ОблКонецРемонт = Макет.ПолучитьОбласть("Конец|Ремонт");

ОблШапкаОбщие.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ОблШапкаОбщие.Параметры.Линейка = ""+Отчет.Линейка + " ("+Отчет.Линейка.Комментарий+")";
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого РМ Из СписокРМ Цикл
		Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
		ОблШапкаСтенд.Параметры.РабочееМесто = РМ.Значение;
		ТабДок.Присоединить(ОблШапкаСтенд);
		Иначе
		ОблШапкаРабочееМесто.Параметры.РабочееМесто = РМ.Значение;
		ТабДок.Присоединить(ОблШапкаРабочееМесто);
		КонецЕсли; 
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаРемонт);

ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ПЗ.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)
	|	И ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0)";
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();

Запрос = Новый Запрос;
ЗапросРемонт = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ КАК ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование КАК МТК,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто КАК РабочееМесто,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Ремонт КАК Ремонт
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Линейка = &Линейка
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование.Номер,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.НомерОчереди,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.Номер
	|ИТОГИ ПО
	|	МТК";	
Запрос.УстановитьПараметр("Линейка",Отчет.Линейка);
Результат = Запрос.Выполнить();
ВыборкаМТК = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
НомСтр = 0;
	Пока ВыборкаМТК.Следующий() Цикл
	ОблМТКОбщие.Параметры.МТК = ВыборкаМТК.МТК;
	ОблМТКОбщие.Параметры.НомерМТК = ВыборкаМТК.МТК.Номер;
	ОблМТКОбщие.Параметры.НО = ВыборкаМТК.МТК.НомерОчереди;
	ОблМТКОбщие.Параметры.Спецификация = СокрЛП(ВыборкаМТК.МТК.Номенклатура.Наименование);
		Если ВыборкаМТК.МТК.Статус = 2 Тогда
		ОблМТКОбщие.Параметры.Остановка = "О";
		Иначе
		ОблМТКОбщие.Параметры.Остановка = "";
		КонецЕсли; 
	ТабДок.Вывести(ОблМТКОбщие);
		Для каждого РМ Из СписокРМ Цикл
			Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
			ТабДок.Присоединить(ОблМТКСтенд);
			Иначе
			ТабДок.Присоединить(ОблМТКРабочееМесто);
			КонецЕсли;
		КонецЦикла;
	ТабДок.Присоединить(ОблМТКРемонт);
	ВыборкаДетальныеЗаписи = ВыборкаМТК.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомСтр = НомСтр + 1;
		ОблПЗОбщие.Параметры.НомСтр = НомСтр;
		СтатусРемонта = Перечисления.СтатусыРемонта.ПустаяСсылка();
		ВыбРМ = ВыборкаДетальныеЗаписи.РабочееМесто;
		ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
		ЗапросРемонт.Текст = 
			"ВЫБРАТЬ
			|	РемонтнаяКарта.Ссылка,
			|	РемонтнаяКарта.Проведен
			|ИЗ
			|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
			|ГДЕ
			|	РемонтнаяКарта.ДокументОснование = &ДокументОснование";			
		ЗапросРемонт.УстановитьПараметр("ДокументОснование", ПЗ);		
		РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();			
		ВыборкаДетальныеЗаписиРемонт = РезультатЗапросаРемонт.Выбрать();			
			Пока ВыборкаДетальныеЗаписиРемонт.Следующий() Цикл
			СтатусРемонта = ?(ВыборкаДетальныеЗаписиРемонт.Проведен,"Завершён","Ремонт");
			КонецЦикла;
        ОблПЗОбщие.Параметры.ПЗ = ПЗ;
		ОблПЗОбщие.Параметры.НомерПЗ = ПЗ.Номер;
		ОблПЗОбщие.Параметры.ВозвратнаяТара = СокрЛП(ПЗ.ВозвратнаяТара);
		ОблПЗОбщие.Параметры.БарКод = ПЗ.БарКод;
		ВыборкаЛО.Сбросить();
		СтуктураПоиска = Новый Структура("ПЗ",ПЗ);
			Если ВыборкаЛО.НайтиСледующий(СтуктураПоиска) Тогда
			ЛО = "ЛО";
			Иначе
			ЛО = "";
			КонецЕсли; 
		ОблПЗОбщие.Параметры.ЛО = ЛО;
		ТабДок.Вывести(ОблПЗОбщие);
		Отбор = Новый Структура("ПЗ",ПЗ);
			Для каждого РМ Из СписокРМ Цикл	
			ДатаНачала = "";
			ДатаОкончания = "";
				Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
				ТекПЗ = РегистрыСведений.СтендовыйПрогон.ПолучитьПоследнее(,Отбор);			
				ОблПЗСтенд.Параметры.ДатаНачала = ТекПЗ.ДатаПостановки;
				ОблПЗСтенд.Параметры.ДатаОкончания = ТекПЗ.ДатаСнятия;
				ОблПЗСтенд.Параметры.Прогон = ТекПЗ.Прогон;
				ТабДок.Присоединить(ОблПЗСтенд);
				Иначе
				ТекПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Отбор);
					Пока ТекПЗ.Следующий() Цикл
						Если ТекПЗ.РабочееМесто = РМ.Значение Тогда
						ДатаНачала = ТекПЗ.ДатаНачала;
						ДатаОкончания = ТекПЗ.ДатаОкончания;
						Прервать;
						КонецЕсли; 
					КонецЦикла;
				ОблПЗРабочееМесто.Параметры.ДатаНачала = ДатаНачала;
				ОблПЗРабочееМесто.Параметры.ДатаОкончания = ДатаОкончания;
				ТабДок.Присоединить(ОблПЗРабочееМесто);
				КонецЕсли;			
			КонецЦикла;
    	ОблПЗРемонт.Параметры.СтатусРемонта = СтатусРемонта;
		ОблПЗРемонт.Параметры.ПЗ = ПЗ;
		ТабДок.Присоединить(ОблПЗРемонт);			
		КонецЦикла;		
	КонецЦикла; 
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого РМ Из СписокРМ Цикл
		Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
		ТабДок.Присоединить(ОблКонецСтенд);
		Иначе
		ТабДок.Присоединить(ОблКонецРабочееМесто);
		КонецЕсли;
	КонецЦикла;
ТабДок.Присоединить(ОблКонецРемонт);
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 6;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
ПолучитьСписокРМ();
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокРМ()
	Если Отчет.Линейка.Пустая() Тогда
	Возврат;
	КонецЕсли; 
СписокРМ.Очистить();
Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка,
	|	РабочиеМестаЛинеек.ПометкаУдаления,
	|	РабочиеМестаЛинеек.Код КАК Код,
	|	РабочиеМестаЛинеек.Линейка,
	|	РабочиеМестаЛинеек.Наименование
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
Запрос.УстановитьПараметр("Линейка", Отчет.Линейка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРМ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
ИмяКолонки = СокрЛП(Сред(Элемент.ТекущаяОбласть.Имя,Найти(Элемент.ТекущаяОбласть.Имя,"C")));
	Если ИмяКолонки <> "C2" Тогда
	СтандартнаяОбработка = Ложь;
	П = Новый Структура("ПЗ",Расшифровка);
	ОткрытьФорму("Отчет.ОтчетПоРемонту.Форма.ФормаОтчета",П);
	КонецЕсли; 
КонецПроцедуры
